* Optimize map by adding a chain-counter into each cell.
The chain-counter stores the number of bucket-lists going through it, so we do
not have to traverse the whole array searching for an element. This optimization
should also be compatible with the one Martin is implementing.
** optimize single map (actual implementation)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:07] =>  0:01
   CLOCK: [2016-11-01 Die 11:38]--[2016-11-01 Die 11:44] =>  0:06
   CLOCK: [2016-10-31 Mon 12:17]--[2016-10-31 Mon 12:32] =>  0:15
   :END:
*** Adjust single map contracts to allow a faster implementation.
    :LOGBOOK:
    CLOCK: [2016-11-01 Die 13:06]--[2016-11-01 Die 13:06] =>  0:00
    CLOCK: [2016-11-01 Die 11:44]--[2016-11-01 Die 11:46] =>  0:02
    CLOCK: [2016-11-01 Die 11:24]--[2016-11-01 Die 11:38] =>  0:14
    :END:
** adjust the double map (add additional array)
   :LOGBOOK:
   CLOCK: [2016-11-01 Die 11:46]--[2016-11-01 Die 11:54] =>  0:08
   :END:
** certify the single map optimization
   :LOGBOOK:
   CLOCK: [2017-03-16 Don 10:20]--[2017-03-16 Don 10:29] =>  0:09
   CLOCK: [2017-03-16 Don 09:43]--[2017-03-16 Don 10:19] =>  0:36
   CLOCK: [2017-03-15 Mit 23:18]--[2017-03-15 Mit 23:38] =>  0:20
   CLOCK: [2017-03-15 Mit 22:58]--[2017-03-15 Mit 23:17] =>  0:19
   CLOCK: [2017-03-15 Mit 19:59]--[2017-03-15 Mit 22:21] =>  2:22
   CLOCK: [2017-03-15 Mit 19:26]--[2017-03-15 Mit 19:56] =>  0:30
   CLOCK: [2017-03-15 Mit 17:27]--[2017-03-15 Mit 17:55] =>  0:28
   CLOCK: [2017-03-15 Mit 15:48]--[2017-03-15 Mit 17:04] =>  1:16
   CLOCK: [2017-03-15 Mit 15:05]--[2017-03-15 Mit 15:39] =>  0:34
   CLOCK: [2017-03-15 Mit 14:22]--[2017-03-15 Mit 14:54] =>  0:32
   CLOCK: [2017-03-15 Mit 11:34]--[2017-03-15 Mit 12:30] =>  0:56
   CLOCK: [2017-03-15 Mit 10:20]--[2017-03-15 Mit 11:04] =>  0:44
   CLOCK: [2017-03-14 Die 19:05]--[2017-03-14 Die 21:12] =>  2:07
   CLOCK: [2017-03-13 Mon 20:01]--[2017-03-13 Mon 21:15] =>  1:14
   CLOCK: [2017-03-13 Mon 18:58]--[2017-03-13 Mon 19:23] =>  0:25
   CLOCK: [2017-03-13 Mon 17:44]--[2017-03-13 Mon 18:13] =>  0:29
   CLOCK: [2017-03-13 Mon 17:06]--[2017-03-13 Mon 17:27] =>  0:21
   CLOCK: [2017-03-13 Mon 12:57]--[2017-03-13 Mon 14:09] =>  1:12
   CLOCK: [2017-03-12 Son 21:46]--[2017-03-12 Son 22:47] =>  1:01
   CLOCK: [2017-03-12 Son 21:12]--[2017-03-12 Son 21:44] =>  0:32
   CLOCK: [2017-03-12 Son 19:59]--[2017-03-12 Son 20:01] =>  0:02
   CLOCK: [2017-03-12 Son 17:14]--[2017-03-12 Son 18:37] =>  1:23
   CLOCK: [2017-03-10 Fre 17:49]--[2017-03-10 Fre 18:23] =>  0:34
   CLOCK: [2017-03-10 Fre 17:03]--[2017-03-10 Fre 17:23] =>  0:20
   CLOCK: [2017-03-10 Fre 16:05]--[2017-03-10 Fre 17:00] =>  0:55
   CLOCK: [2017-03-10 Fre 15:17]--[2017-03-10 Fre 15:44] =>  0:27
   CLOCK: [2017-03-10 Fre 12:28]--[2017-03-10 Fre 15:15] =>  2:47
   CLOCK: [2017-03-09 Don 20:08]--[2017-03-09 Don 21:54] =>  1:46
   CLOCK: [2017-03-09 Don 18:51]--[2017-03-09 Don 19:20] =>  0:29
   CLOCK: [2017-03-09 Don 15:53]--[2017-03-09 Don 17:09] =>  1:16
   CLOCK: [2017-03-09 Don 14:25]--[2017-03-09 Don 14:41] =>  0:16
   CLOCK: [2017-03-09 Don 13:10]--[2017-03-09 Don 14:23] =>  1:13
   CLOCK: [2017-03-08 Mit 18:05]--[2017-03-08 Mit 18:31] =>  0:26
   CLOCK: [2017-03-08 Mit 17:22]--[2017-03-08 Mit 17:58] =>  0:36
   CLOCK: [2017-03-08 Mit 15:43]--[2017-03-08 Mit 15:59] =>  0:16
   CLOCK: [2017-03-08 Mit 15:13]--[2017-03-08 Mit 15:40] =>  0:27
   CLOCK: [2017-03-08 Mit 13:25]--[2017-03-08 Mit 14:52] =>  1:27
   CLOCK: [2017-03-07 Die 15:21]--[2017-03-07 Die 16:12] =>  0:51
   CLOCK: [2017-03-06 Mon 17:07]--[2017-03-06 Mon 18:05] =>  0:58
   CLOCK: [2017-03-06 Mon 13:21]--[2017-03-06 Mon 15:35] =>  2:14
   CLOCK: [2017-03-02 Don 17:25]--[2017-03-02 Don 17:27] =>  0:02
   CLOCK: [2017-02-28 Die 12:45]--[2017-02-28 Die 14:30] =>  1:45
   CLOCK: [2017-02-17 Fre 16:20]--[2017-02-17 Fre 16:35] =>  0:15
   CLOCK: [2017-02-17 Fre 14:33]--[2017-02-17 Fre 15:52] =>  1:19
   CLOCK: [2017-02-17 Fre 14:10]--[2017-02-17 Fre 14:27] =>  0:17
   CLOCK: [2017-02-17 Fre 11:37]--[2017-02-17 Fre 12:35] =>  0:58
   CLOCK: [2017-02-16 Don 15:53]--[2017-02-16 Don 16:11] =>  0:18
   CLOCK: [2017-02-16 Don 15:09]--[2017-02-16 Don 15:43] =>  0:34
   CLOCK: [2017-02-16 Don 12:58]--[2017-02-16 Don 14:22] =>  1:24
   CLOCK: [2017-02-16 Don 12:23]--[2017-02-16 Don 12:49] =>  0:26
   CLOCK: [2017-02-16 Don 11:25]--[2017-02-16 Don 11:29] =>  0:04
   CLOCK: [2017-01-05 Don 10:40]--[2017-01-05 Don 11:25] =>  0:45
   CLOCK: [2017-01-05 Don 10:28]--[2017-01-05 Don 10:36] =>  0:08
   CLOCK: [2017-01-05 Don 10:11]--[2017-01-05 Don 10:21] =>  0:10
   CLOCK: [2017-01-04 Mit 10:57]--[2017-01-04 Mit 11:00] =>  0:03
   CLOCK: [2017-01-03 Die 08:42]--[2017-01-03 Die 08:58] =>  0:16
   CLOCK: [2017-01-01 Son 14:44]--[2017-01-01 Son 14:59] =>  0:15
   CLOCK: [2017-01-01 Son 13:55]--[2017-01-01 Son 13:56] =>  0:01
   CLOCK: [2017-01-01 Son 13:03]--[2017-01-01 Son 13:36] =>  0:33
   CLOCK: [2016-12-31 Sam 12:35]--[2016-12-31 Sam 12:46] =>  0:11
   CLOCK: [2016-12-31 Sam 12:20]--[2016-12-31 Sam 12:31] =>  0:11
   CLOCK: [2016-12-31 Sam 03:41]--[2016-12-31 Sam 03:47] =>  0:06
   CLOCK: [2016-12-30 Fre 23:30]--[2016-12-31 Sam 00:24] =>  0:54
   CLOCK: [2016-12-16 Fre 14:03]--[2016-12-16 Fre 14:25] =>  0:22
   CLOCK: [2016-12-16 Fre 13:07]--[2016-12-16 Fre 13:59] =>  0:52
   CLOCK: [2016-12-16 Fre 12:52]--[2016-12-16 Fre 13:05] =>  0:13
   CLOCK: [2016-12-16 Fre 12:42]--[2016-12-16 Fre 12:43] =>  0:01
   CLOCK: [2016-12-16 Fre 11:27]--[2016-12-16 Fre 11:59] =>  0:32
   CLOCK: [2016-12-15 Don 21:45]--[2016-12-15 Don 22:30] =>  0:45
   CLOCK: [2016-12-15 Don 19:55]--[2016-12-15 Don 20:02] =>  0:07
   CLOCK: [2016-12-15 Don 17:51]--[2016-12-15 Don 18:12] =>  0:21
   CLOCK: [2016-12-15 Don 16:42]--[2016-12-15 Don 17:44] =>  1:02
   CLOCK: [2016-12-14 Mit 22:36]--[2016-12-14 Mit 22:56] =>  0:20
   CLOCK: [2016-12-14 Mit 22:14]--[2016-12-14 Mit 22:35] =>  0:21
   CLOCK: [2016-12-14 Mit 15:37]--[2016-12-14 Mit 17:31] =>  1:54
   CLOCK: [2016-12-14 Mit 14:11]--[2016-12-14 Mit 15:03] =>  0:52
   CLOCK: [2016-12-14 Mit 08:44]--[2016-12-14 Mit 09:44] =>  1:00
   CLOCK: [2016-12-13 Die 19:42]--[2016-12-13 Die 21:17] =>  1:35
   CLOCK: [2016-12-13 Die 15:01]--[2016-12-13 Die 15:51] =>  0:50
   CLOCK: [2016-12-13 Die 13:22]--[2016-12-13 Die 13:50] =>  0:28
   CLOCK: [2016-12-13 Die 12:22]--[2016-12-13 Die 12:35] =>  0:13
   CLOCK: [2016-12-13 Die 12:09]--[2016-12-13 Die 12:17] =>  0:08
   CLOCK: [2016-12-13 Die 10:26]--[2016-12-13 Die 10:43] =>  0:17
   CLOCK: [2016-12-12 Mon 20:39]--[2016-12-12 Mon 20:57] =>  0:18
   CLOCK: [2016-12-12 Mon 18:54]--[2016-12-12 Mon 19:51] =>  0:57
   CLOCK: [2016-12-12 Mon 18:09]--[2016-12-12 Mon 18:48] =>  0:39
   CLOCK: [2016-12-12 Mon 17:13]--[2016-12-12 Mon 17:54] =>  0:41
   CLOCK: [2016-12-12 Mon 09:57]--[2016-12-12 Mon 10:14] =>  0:17
   CLOCK: [2016-12-12 Mon 09:01]--[2016-12-12 Mon 09:35] =>  0:34
   CLOCK: [2016-12-11 Son 14:51]--[2016-12-11 Son 15:18] =>  0:27
   CLOCK: [2016-12-11 Son 14:22]--[2016-12-11 Son 14:51] =>  0:29
   CLOCK: [2016-12-11 Son 13:59]--[2016-12-11 Son 14:00] =>  0:01
   CLOCK: [2016-12-11 Son 12:44]--[2016-12-11 Son 13:59] =>  1:15
   CLOCK: [2016-12-11 Son 12:19]--[2016-12-11 Son 12:44] =>  0:25
   CLOCK: [2016-12-11 Son 12:00]--[2016-12-11 Son 12:09] =>  0:09
   CLOCK: [2016-12-11 Son 11:24]--[2016-12-11 Son 11:47] =>  0:23
   CLOCK: [2016-12-11 Son 10:25]--[2016-12-11 Son 11:24] =>  0:59
   CLOCK: [2016-12-11 Son 09:44]--[2016-12-11 Son 10:10] =>  0:26
   CLOCK: [2016-12-10 Sam 20:16]--[2016-12-10 Sam 21:17] =>  1:01
   CLOCK: [2016-12-10 Sam 20:07]--[2016-12-10 Sam 20:13] =>  0:06
   CLOCK: [2016-12-10 Sam 18:45]--[2016-12-10 Sam 19:40] =>  0:55
   CLOCK: [2016-12-10 Sam 17:11]--[2016-12-10 Sam 18:01] =>  0:50
   CLOCK: [2016-12-10 Sam 14:46]--[2016-12-10 Sam 15:22] =>  0:36
   CLOCK: [2016-12-10 Sam 12:53]--[2016-12-10 Sam 12:58] =>  0:05
   CLOCK: [2016-12-10 Sam 10:48]--[2016-12-10 Sam 11:36] =>  0:48
   CLOCK: [2016-12-09 Fre 21:03]--[2016-12-09 Fre 21:15] =>  0:12
   CLOCK: [2016-12-09 Fre 19:50]--[2016-12-09 Fre 20:52] =>  1:02
   CLOCK: [2016-12-09 Fre 14:09]--[2016-12-09 Fre 14:11] =>  0:02
   CLOCK: [2016-12-09 Fre 13:51]--[2016-12-09 Fre 13:57] =>  0:06
   CLOCK: [2016-12-09 Fre 13:14]--[2016-12-09 Fre 13:35] =>  0:21
   CLOCK: [2016-12-08 Don 21:06]--[2016-12-08 Don 21:57] =>  0:51
   CLOCK: [2016-12-08 Don 20:51]--[2016-12-08 Don 21:05] =>  0:14
   CLOCK: [2016-12-08 Don 20:40]--[2016-12-08 Don 20:48] =>  0:08
   CLOCK: [2016-12-08 Don 19:47]--[2016-12-08 Don 20:18] =>  0:31
   CLOCK: [2016-12-08 Don 15:02]--[2016-12-08 Don 16:08] =>  1:06
   CLOCK: [2016-12-08 Don 12:56]--[2016-12-08 Don 14:20] =>  1:24
   CLOCK: [2016-12-08 Don 12:05]--[2016-12-08 Don 12:08] =>  0:03
   CLOCK: [2016-12-08 Don 10:38]--[2016-12-08 Don 11:05] =>  0:27
   CLOCK: [2016-12-06 Die 17:02]--[2016-12-06 Die 17:10] =>  0:08
   CLOCK: [2016-12-06 Die 14:38]--[2016-12-06 Die 16:09] =>  1:31
   CLOCK: [2016-12-06 Die 14:21]--[2016-12-06 Die 14:27] =>  0:06
   CLOCK: [2016-12-06 Die 14:18]--[2016-12-06 Die 14:20] =>  0:02
   CLOCK: [2016-12-06 Die 11:20]--[2016-12-06 Die 12:04] =>  0:44
   CLOCK: [2016-12-05 Mon 19:32]--[2016-12-05 Mon 19:36] =>  0:04
   CLOCK: [2016-12-05 Mon 12:57]--[2016-12-05 Mon 13:31] =>  0:34
   CLOCK: [2016-12-05 Mon 11:42]--[2016-12-05 Mon 12:29] =>  0:47
   CLOCK: [2016-12-05 Mon 10:47]--[2016-12-05 Mon 11:30] =>  0:43
   CLOCK: [2016-12-04 Son 18:54]--[2016-12-04 Son 19:54] =>  1:00
   CLOCK: [2016-12-04 Son 16:12]--[2016-12-04 Son 16:44] =>  0:32
   CLOCK: [2016-12-04 Son 15:53]--[2016-12-04 Son 16:12] =>  0:19
   CLOCK: [2016-12-04 Son 15:39]--[2016-12-04 Son 15:53] =>  0:14
   CLOCK: [2016-12-04 Son 14:20]--[2016-12-04 Son 15:12] =>  0:52
   CLOCK: [2016-12-04 Son 13:18]--[2016-12-04 Son 13:36] =>  0:18
   CLOCK: [2016-12-04 Son 12:20]--[2016-12-04 Son 13:56] =>  0:36
   CLOCK: [2016-12-04 Son 10:34]--[2016-12-04 Son 12:01] =>  1:27
   CLOCK: [2016-12-03 Sam 14:25]--[2016-12-03 Sam 16:23] =>  1:58
   CLOCK: [2016-12-03 Sam 13:03]--[2016-12-03 Sam 13:39] =>  0:36
   CLOCK: [2016-12-02 Fre 15:57]--[2016-12-02 Fre 16:02] =>  0:05
   CLOCK: [2016-12-02 Fre 15:39]--[2016-12-02 Fre 15:44] =>  0:05
   CLOCK: [2016-12-02 Fre 14:33]--[2016-12-02 Fre 15:09] =>  0:36
   CLOCK: [2016-12-01 Don 18:33]--[2016-12-01 Don 18:54] =>  0:21
   CLOCK: [2016-12-01 Don 18:05]--[2016-12-01 Don 18:26] =>  0:21
   CLOCK: [2016-12-01 Don 17:39]--[2016-12-01 Don 17:43] =>  0:04
   CLOCK: [2016-12-01 Don 15:37]--[2016-12-01 Don 15:43] =>  0:06
   CLOCK: [2016-12-01 Don 14:33]--[2016-12-01 Don 14:59] =>  0:26
   CLOCK: [2016-12-01 Don 13:52]--[2016-12-01 Don 14:28] =>  0:36
   CLOCK: [2016-12-01 Don 11:05]--[2016-12-01 Don 11:16] =>  0:11
   CLOCK: [2016-11-30 Mit 21:49]--[2016-11-30 Mit 21:55] =>  0:06
   CLOCK: [2016-11-30 Mit 21:10]--[2016-11-30 Mit 21:49] =>  0:39
   CLOCK: [2016-11-30 Mit 20:57]--[2016-11-30 Mit 21:10] =>  0:13
   CLOCK: [2016-11-30 Mit 20:22]--[2016-11-30 Mit 20:45] =>  0:23
   CLOCK: [2016-11-30 Mit 16:13]--[2016-11-30 Mit 17:00] =>  0:47
   CLOCK: [2016-11-30 Mit 15:13]--[2016-11-30 Mit 15:52] =>  0:39
   CLOCK: [2016-11-30 Mit 14:25]--[2016-11-30 Mit 15:04] =>  0:39
   CLOCK: [2016-11-30 Mit 13:16]--[2016-11-30 Mit 13:48] =>  0:32
   CLOCK: [2016-11-30 Mit 13:09]--[2016-11-30 Mit 13:11] =>  0:02
   CLOCK: [2016-11-30 Mit 12:58]--[2016-11-30 Mit 13:05] =>  0:07
   CLOCK: [2016-11-30 Mit 11:05]--[2016-11-30 Mit 12:09] =>  1:04
   CLOCK: [2016-11-29 Die 15:23]--[2016-11-29 Die 15:44] =>  0:21
   CLOCK: [2016-11-29 Die 12:55]--[2016-11-29 Die 14:46] =>  1:51
   CLOCK: [2016-11-29 Die 12:44]--[2016-11-29 Die 12:46] =>  0:02
   CLOCK: [2016-11-29 Die 12:19]--[2016-11-29 Die 12:30] =>  0:11
   CLOCK: [2016-11-29 Die 11:25]--[2016-11-29 Die 11:51] =>  0:26
   CLOCK: [2016-11-29 Die 09:53]--[2016-11-29 Die 11:02] =>  1:09
   CLOCK: [2016-11-28 Mon 17:33]--[2016-11-28 Mon 18:21] =>  0:48
   CLOCK: [2016-11-28 Mon 13:10]--[2016-11-28 Mon 13:42] =>  0:32
   CLOCK: [2016-11-28 Mon 13:01]--[2016-11-28 Mon 13:10] =>  0:09
   CLOCK: [2016-11-28 Mon 12:38]--[2016-11-28 Mon 12:52] =>  0:14
   CLOCK: [2016-11-28 Mon 11:01]--[2016-11-28 Mon 11:56] =>  0:55
   CLOCK: [2016-11-28 Mon 09:16]--[2016-11-28 Mon 09:27] =>  0:11
   CLOCK: [2016-11-27 Son 20:44]--[2016-11-27 Son 20:49] =>  0:05
   CLOCK: [2016-11-27 Son 20:18]--[2016-11-27 Son 20:27] =>  0:09
   CLOCK: [2016-11-27 Son 19:38]--[2016-11-27 Son 20:15] =>  0:37
   CLOCK: [2016-11-27 Son 17:24]--[2016-11-27 Son 18:05] =>  0:41
   CLOCK: [2016-11-27 Son 16:09]--[2016-11-27 Son 17:05] =>  0:56
   CLOCK: [2016-11-27 Son 13:55]--[2016-11-27 Son 14:54] =>  0:59
   CLOCK: [2016-11-27 Son 11:57]--[2016-11-27 Son 12:30] =>  0:33
   CLOCK: [2016-11-27 Son 11:34]--[2016-11-27 Son 11:41] =>  0:07
   CLOCK: [2016-11-27 Son 11:27]--[2016-11-27 Son 11:27] =>  0:00
   CLOCK: [2016-11-27 Son 11:19]--[2016-11-27 Son 11:26] =>  0:07
   CLOCK: [2016-11-26 Sam 21:26]--[2016-11-26 Sam 21:47] =>  0:21
   CLOCK: [2016-11-26 Sam 20:24]--[2016-11-26 Sam 20:39] =>  0:15
   CLOCK: [2016-11-26 Sam 20:12]--[2016-11-26 Sam 20:23] =>  0:11
   CLOCK: [2016-11-26 Sam 19:33]--[2016-11-26 Sam 19:54] =>  0:21
   CLOCK: [2016-11-26 Sam 19:16]--[2016-11-26 Sam 19:32] =>  0:16
   CLOCK: [2016-11-26 Sam 11:41]--[2016-11-26 Sam 11:45] =>  0:04
   CLOCK: [2016-11-25 Fre 15:12]--[2016-11-25 Fre 15:29] =>  0:17
   CLOCK: [2016-11-25 Fre 14:50]--[2016-11-25 Fre 15:05] =>  0:15
   CLOCK: [2016-11-25 Fre 14:31]--[2016-11-25 Fre 14:45] =>  0:14
   CLOCK: [2016-11-25 Fre 14:09]--[2016-11-25 Fre 14:17] =>  0:08
   CLOCK: [2016-11-25 Fre 13:09]--[2016-11-25 Fre 13:45] =>  0:36
   CLOCK: [2016-11-24 Don 18:45]--[2016-11-24 Don 19:10] =>  0:25
   CLOCK: [2016-11-24 Don 17:42]--[2016-11-24 Don 18:26] =>  0:44
   CLOCK: [2016-11-24 Don 17:13]--[2016-11-24 Don 17:36] =>  0:23
   CLOCK: [2016-11-24 Don 14:59]--[2016-11-24 Don 15:33] =>  0:34
   CLOCK: [2016-11-24 Don 13:19]--[2016-11-24 Don 13:53] =>  0:34
   CLOCK: [2016-11-24 Don 12:20]--[2016-11-24 Don 13:06] =>  0:46
   CLOCK: [2016-11-24 Don 12:11]--[2016-11-24 Don 12:17] =>  0:06
   CLOCK: [2016-11-24 Don 10:03]--[2016-11-24 Don 11:38] =>  1:35
   CLOCK: [2016-11-24 Don 09:36]--[2016-11-24 Don 09:46] =>  0:10
   CLOCK: [2016-11-24 Don 08:53]--[2016-11-24 Don 09:07] =>  0:14
   CLOCK: [2016-11-23 Mit 22:09]--[2016-11-23 Mit 22:15] =>  0:06
   CLOCK: [2016-11-23 Mit 21:35]--[2016-11-23 Mit 21:51] =>  0:16
   CLOCK: [2016-11-23 Mit 16:26]--[2016-11-23 Mit 16:42] =>  0:16
   CLOCK: [2016-11-23 Mit 15:23]--[2016-11-23 Mit 15:34] =>  0:11
   CLOCK: [2016-11-23 Mit 11:59]--[2016-11-23 Mit 12:06] =>  0:07
   CLOCK: [2016-11-22 Die 18:10]--[2016-11-22 Die 18:11] =>  0:01
   CLOCK: [2016-11-22 Die 18:09]--[2016-11-22 Die 18:10] =>  0:01
   CLOCK: [2016-11-22 Die 17:53]--[2016-11-22 Die 18:05] =>  0:12
   CLOCK: [2016-11-22 Die 14:34]--[2016-11-22 Die 15:05] =>  0:31
   CLOCK: [2016-11-22 Die 11:36]--[2016-11-22 Die 11:51] =>  0:15
   CLOCK: [2016-11-21 Mon 13:33]--[2016-11-21 Mon 13:41] =>  0:08
   CLOCK: [2016-11-21 Mon 12:59]--[2016-11-21 Mon 13:13] =>  0:14
   CLOCK: [2016-11-19 Sam 15:19]--[2016-11-19 Sam 15:41] =>  0:22
   CLOCK: [2016-11-19 Sam 15:08]--[2016-11-19 Sam 15:09] =>  0:01
   CLOCK: [2016-11-18 Fre 14:33]--[2016-11-18 Fre 15:50] =>  1:17
   CLOCK: [2016-11-17 Don 18:47]--[2016-11-17 Don 19:27] =>  0:40
   CLOCK: [2016-11-16 Mit 15:54]--[2016-11-16 Mit 16:23] =>  0:29
   CLOCK: [2016-11-16 Mit 14:29]--[2016-11-16 Mit 15:36] =>  1:07
   CLOCK: [2016-11-16 Mit 14:10]--[2016-11-16 Mit 14:16] =>  0:06
   CLOCK: [2016-11-16 Mit 13:35]--[2016-11-16 Mit 13:45] =>  0:10
   CLOCK: [2016-11-16 Mit 13:00]--[2016-11-16 Mit 13:12] =>  0:12
   CLOCK: [2016-11-16 Mit 12:20]--[2016-11-16 Mit 12:56] =>  0:36
   CLOCK: [2016-11-15 Die 21:18]--[2016-11-15 Die 22:22] =>  1:04
   CLOCK: [2016-11-15 Die 17:17]--[2016-11-15 Die 18:03] =>  0:46
   CLOCK: [2016-11-15 Die 14:40]--[2016-11-15 Die 15:27] =>  0:47
   CLOCK: [2016-11-15 Die 14:16]--[2016-11-15 Die 14:27] =>  0:11
   CLOCK: [2016-11-15 Die 13:52]--[2016-11-15 Die 14:04] =>  0:12
   CLOCK: [2016-11-13 Son 21:04]--[2016-11-13 Son 22:02] =>  0:58
   CLOCK: [2016-11-13 Son 20:13]--[2016-11-13 Son 20:19] =>  0:06
   CLOCK: [2016-11-13 Son 19:29]--[2016-11-13 Son 20:06] =>  0:37
   CLOCK: [2016-11-13 Son 19:14]--[2016-11-13 Son 19:25] =>  0:11
   CLOCK: [2016-11-13 Son 18:39]--[2016-11-13 Son 18:44] =>  0:05
   CLOCK: [2016-11-13 Son 18:17]--[2016-11-13 Son 18:35] =>  0:18
   CLOCK: [2016-11-13 Son 17:48]--[2016-11-13 Son 18:04] =>  0:16
   CLOCK: [2016-11-13 Son 15:58]--[2016-11-13 Son 16:28] =>  0:30
   CLOCK: [2016-11-13 Son 15:28]--[2016-11-13 Son 15:40] =>  0:12
   CLOCK: [2016-11-11 Fre 14:36]--[2016-11-11 Fre 14:44] =>  0:08
   CLOCK: [2016-11-11 Fre 14:24]--[2016-11-11 Fre 14:33] =>  0:09
   CLOCK: [2016-11-11 Fre 12:33]--[2016-11-11 Fre 13:00] =>  0:27
   CLOCK: [2016-11-11 Fre 10:35]--[2016-11-11 Fre 10:36] =>  0:01
   CLOCK: [2016-11-10 Don 22:20]--[2016-11-10 Don 22:37] =>  0:17
   CLOCK: [2016-11-10 Don 20:11]--[2016-11-10 Don 21:34] =>  1:23
   CLOCK: [2016-11-10 Don 19:45]--[2016-11-10 Don 19:58] =>  0:13
   CLOCK: [2016-11-10 Don 19:10]--[2016-11-10 Don 19:45] =>  0:35
   CLOCK: [2016-11-10 Don 18:47]--[2016-11-10 Don 19:08] =>  0:21
   CLOCK: [2016-11-10 Don 17:25]--[2016-11-10 Don 17:58] =>  0:33
   CLOCK: [2016-11-10 Don 16:33]--[2016-11-10 Don 17:12] =>  0:39
   CLOCK: [2016-11-10 Don 16:26]--[2016-11-10 Don 16:30] =>  0:04
   CLOCK: [2016-11-10 Don 16:06]--[2016-11-10 Don 16:08] =>  0:02
   CLOCK: [2016-11-10 Don 15:18]--[2016-11-10 Don 15:46] =>  0:28
   CLOCK: [2016-11-10 Don 15:10]--[2016-11-10 Don 15:12] =>  0:02
   CLOCK: [2016-11-10 Don 14:48]--[2016-11-10 Don 14:55] =>  0:07
   CLOCK: [2016-11-10 Don 13:52]--[2016-11-10 Don 14:35] =>  0:43
   CLOCK: [2016-11-10 Don 11:59]--[2016-11-10 Don 12:07] =>  0:08
   CLOCK: [2016-11-10 Don 11:52]--[2016-11-10 Don 11:57] =>  0:05
   CLOCK: [2016-11-10 Don 10:09]--[2016-11-10 Don 10:30] =>  0:21
   :END:
*** design the abstract logical model
    :LOGBOOK:
    CLOCK: [2016-11-23 Mit 11:51]--[2016-11-23 Mit 11:59] =>  0:08
    CLOCK: [2016-11-23 Mit 11:49]--[2016-11-23 Mit 11:51] =>  0:02
    CLOCK: [2016-11-08 Die 18:53]--[2016-11-08 Die 18:53] =>  0:00
    CLOCK: [2016-11-08 Die 18:37]--[2016-11-08 Die 18:52] =>  0:15
    CLOCK: [2016-11-08 Die 15:52]--[2016-11-08 Die 16:01] =>  0:09
    CLOCK: [2016-11-08 Die 15:42]--[2016-11-08 Die 15:47] =>  0:05
    CLOCK: [2016-11-08 Die 15:23]--[2016-11-08 Die 15:33] =>  0:10
    CLOCK: [2016-11-08 Die 12:40]--[2016-11-08 Die 12:45] =>  0:05
    CLOCK: [2016-11-08 Die 12:37]--[2016-11-08 Die 12:38] =>  0:01
    CLOCK: [2016-11-08 Die 12:22]--[2016-11-08 Die 12:36] =>  0:14
    CLOCK: [2016-11-08 Die 11:37]--[2016-11-08 Die 11:43] =>  0:06
    CLOCK: [2016-11-08 Die 10:51]--[2016-11-08 Die 10:53] =>  0:02
    CLOCK: [2016-11-08 Die 10:05]--[2016-11-08 Die 10:11] =>  0:06
    CLOCK: [2016-11-01 Die 15:41]--[2016-11-01 Die 15:56] =>  0:15
    CLOCK: [2016-11-01 Die 15:14]--[2016-11-01 Die 15:38] =>  0:24
    CLOCK: [2016-11-01 Die 15:07]--[2016-11-01 Die 15:09] =>  0:02
    CLOCK: [2016-11-01 Die 13:23]--[2016-11-01 Die 13:35] =>  0:12
    CLOCK: [2016-11-01 Die 13:07]--[2016-11-01 Die 13:08] =>  0:01
    :END:
** certify the double map modifications
   Done, time not counted, probably amounts to < 1h
** refactor proof
*** split into modules
    :LOGBOOK:
    CLOCK: [2017-02-15 Mit 16:43]--[2017-02-15 Mit 17:05] =>  0:22
    CLOCK: [2017-02-15 Mit 14:46]--[2017-02-15 Mit 15:10] =>  0:24
    CLOCK: [2017-02-15 Mit 13:02]--[2017-02-15 Mit 13:28] =>  0:26
    CLOCK: [2017-02-15 Mit 11:49]--[2017-02-15 Mit 12:29] =>  0:40
    CLOCK: [2017-02-15 Mit 11:08]--[2017-02-15 Mit 11:21] =>  0:13
    CLOCK: [2017-02-15 Mit 09:53]--[2017-02-15 Mit 10:46] =>  0:53
    CLOCK: [2017-02-14 Die 19:18]--[2017-02-14 Die 21:34] =>  2:16
    CLOCK: [2017-02-14 Die 14:32]--[2017-02-14 Die 14:54] =>  0:22
    :END:
   
